cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"

tap "1password/tap"
tap "aws/tap"
tap "commandplaneio/copl"
tap "derailed/popeye"
tap "github/gh"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "jorgelbg/tap"
tap "kubescape/tap"

brew "act"
brew "ansible"
brew "argocd"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "circleci"
brew "colima"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "ffmpeg"
brew "gettext"
brew "gh"
brew "git"
brew "go"
brew "graphviz"
brew "grc"
brew "helm"
brew "highlight"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "k3d"
brew "k6"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kubent"
brew "kubescape", link: false
brew "kustomize"
brew "lazygit"
brew "mas"
brew "mkcert"
brew "mysql-client@8.0"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "python@3.11"
brew "rbenv"
brew "ruby"
brew "shellcheck"
brew "starship"
brew "tailscale", link: false
brew "telnet"
brew "terminal-notifier"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"

brew "commandplaneio/copl/copl"
brew "derailed/popeye/popeye"
brew "kubescape/tap/kubescape-cli"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "1password"
cask "1password/tap/1password-cli"
cask "airfoil"
cask "brave-browser"
cask "datagrip"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "linear-linear"
cask "notion"
cask "pycharm"
cask "rescuetime"
cask "slack"
cask "spotify"
cask "tailscale"
cask "telegram"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "whatsapp"
cask "zoom"

# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# MacApp Store Apps
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "Spark", id: 1176895641
mas "TrashMe", id: 443126292
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

#VSCode
vscode "1password.op-vscode"
vscode "amazonwebservices.amazon-q-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "gera2ld.markmap-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jinliming2.vscode-go-template"
vscode "jmmeessen.jenkins-declarative-support"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rescuetime.rescuetime"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "xyz.local-history"
