cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "1password/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "jorgelbg/tap"

brew "ansible"
brew "marcel-dias/tap/antibody"
brew "aws-iam-authenticator"
brew "awscli"
brew "gettext"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gettext"
brew "gh"
brew "git"
brew "go"
brew "grc"
brew "helm"
brew "helm@2"
brew "highlight"
brew "htop"
brew "hugo"
brew "jq"
brew "k3d"
brew "kind"
brew "kubectx"
brew "lazygit"
brew "mas"
brew "mkcert"
brew "node"
brew "nvm"
brew "openjdk@17"
brew "pinentry-mac"
brew "pinentry-touchid"
brew "rbenv"
brew "shellcheck"
brew "starship"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "vim"
brew "wakatime-cli"
brew "wget"
brew "zsh"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "1password/tap/1password-cli"
cask "airfoil"
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-drive"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite-no-mail"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "lens"
cask "recordit"
cask "rescuetime"
cask "slack"
cask "spotify"
cask "telegram"
cask "transmission"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlvideo"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# MacApp Store Apps
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "TrashMe", id: 443126292
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
