cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "1password/tap"
tap "commandplaneio/copl"
tap "derailed/popeye"
tap "github/gh"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "jorgelbg/tap"
tap "kubescape/tap"

brew "act"
brew "ansible"
brew "argocd"
brew "aws-iam-authenticator"
brew "awscli"
brew "circleci"
brew "colima"
brew "diff-so-fancy"
brew "docker"
brew "docker-credential-helper"
brew "ffmpeg"
brew "gettext"
brew "gh"
brew "git"
brew "go"
brew "graphviz"
brew "grc"
brew "helm"
brew "highlight"
brew "htop"
brew "hugo"
brew "jq"
brew "k3d"
brew "kind"
brew "kubectx"
brew "kubent"
brew "kubescape", link: false
brew "kustomize"
brew "lazygit"
brew "mas"
brew "mkcert"
brew "mysql"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "pinentry-mac"
brew "rbenv"
brew "ruby"
brew "shellcheck"
brew "starship"
brew "tailscale", link: false
brew "telnet"
brew "terminal-notifier"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "vim"
brew "wakatime-cli"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"

brew "commandplaneio/copl/copl"
brew "derailed/popeye/popeye"
brew "kubescape/tap/kubescape-cli"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "1password"
cask "1password/tap/1password-cli"
cask "airfoil"
cask "brave-browser"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "linear-linear"
cask "notion"
cask "pycharm"
cask "recordit"
cask "redisinsight"
cask "rescuetime"
cask "slack"
cask "spotify"
cask "tailscale"
cask "telegram"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "whatsapp"
cask "zoom"

# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlvideo"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# MacApp Store Apps
mas "Amphetamine", id: 937984704
mas "Kindle Classic", id: 405399194
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "Spark", id: 1176895641
mas "TrashMe", id: 443126292
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296
